{
  "intents": [
    {
      "tag": "introduction",
      "patterns": [
        "Hi",
        "Hey",
        "Hello",
        "How are you?",
        "How are you doing?",
        "Yo",
        "Good morning",
        "Good afternoon",
        "Good morning",
        "Hey there",
        "Howdy",
        "Greetings",
        "Ahoy",
        "How is it going?",
        "Hi, I think I have a problem.",
        "Hello, can you help me?"
      ],
      "responses": [
        "Hi!",
        "Hi",
        "Hello, thank you for stopping by to say hello.",
        "Hi, how may I help you?",
        "Hello, how may I assist you?",
        "Hey, what seems to be the problem?",
        "Of course! What would you like assistance with?",
        "I am doing just fine! What about you?",
        "Would you happen to have any questions for me?"
      ]
    },
    {
      "tag": "end_conversation",
      "patterns": [
        "Goodbye",
        "Bye",
        "Talk to you later",
        "See you later",
        "See you soon!",
        "Until next time.",
        "It has been a pleasure!",
        "Thank you!",
        "Thank you for all the help."
      ],
      "responses": [
        "You are welcome",
        "You're welcome",
        "My pleasure",
        "No problem!",
        "Of course",
        "Anytime!"
      ]
    },
    {
      "tag": "treatment_discussion",
      "patterns": [
        "I would like to talk about a potential injury.",
        "I feel some kind of pain in my body.",
        "Do you think that you could help me with something?",
        "I would like some clarification on something that my body is going through.",
        "I do not feel so good. May I ask you some questions?",
        "I feel sick.",
        "I am in serious pain.",
        "I need help.",
        "Could you help me resolve this issue I have been having?",
        "Could you provide me with some insight on a condition I think I have?"
      ],
      "responses": [
        "I am open to hearing about any issues that you would like to discuss.",
        "What has been going on?",
        "Explain what is going on in your body.",
        "Please elaborate on how you feel.",
        "I am sorry you feel this way. Would you like to discuss what is going on?"
      ]
    },
    {
      "tag": "referral",
      "patterns": [
        "Where should I go from here?",
        "Should I still see a doctor?",
        "Now I know what I have. What do I do from here?",
        "I still feel sick. What do I do?"
      ],
      "responses": [
        "Keep in mind that Odessa is not an alternative to seeing an actual doctor. Please seek the correct and appropriate medical professionals so that you can receive proper diagnosis and treatment."
      ]
    },
        {
      "tag": "flu_definition",
      "patterns": [
        "What is the flu?",
        "Could you define the flu?",
        "Explain the flu to me.",
        "Flu?"
      ],
      "responses": [
        "The flu is an illness that affects the respiratory system, which can affect areas such as the nose, throat, and lungs."
      ]
    },
        {
      "tag": "flu_prevention",
      "patterns": [
        "What can I do to prevent the flu?",
        "What can I do to lower the changes of me getting the flu?",
        "Is the flu preventable?",
        "Could you help me mitigate the risk of getting the flu?",
        "How do I stop the flu?",
        "How do I treat the flu?"
      ],
      "responses": [
        "This ailment can be prevented best by getting a yearly flu vaccine."
      ]
    },
        {
      "tag": "flu_symptoms",
      "patterns": [
        "What are symptoms of the flu?",
        "Could you list some of the symptoms of the flu?",
        "Flu symptoms?",
        "What does the flu look like?",
        "What effect does the flu have on a person's body?"
      ],
      "responses": [
        "Some symptoms of the flu include a cough, sore throat, fever, chills, runny or stuffy nose, muscle or body aches, headaches, fatigue, vomiting, and diarrhea."
      ]
    },
        {
      "tag": "flu_duration",
      "patterns": [
        "How long does the flu last?",
        "When will the flu go away?",
        "For when should I expect flu symptoms to go away?",
        "After how many days will the flu go away?",
        "After how many weeks will the flu go away?"
      ],
      "responses": [
        "The flu can last up to three to seven days."
      ]
    },
        {
      "tag": "cold_definition",
      "patterns": [
        "What is a cold?",
        "Could you define a cold?",
        "Explain a cold to me.",
        "Cold?"
      ],
      "responses": [
        "A cold is a viral infection that impacts the upper respiratory tract."
      ]
    },
        {
      "tag": "cold_prevention",
      "patterns": [
        "What can I do to prevent a cold?",
        "What can I do to lower the changes of me getting a cold?",
        "Is a cold preventable?",
        "Could you help me mitigate the risk of getting a cold?",
        "How do I stop a cold?",
        "How do I treat a cold?"

      ],
      "responses": [
        "A cold can be prevented by refraining from physically interacting with people who are sick and washing your hands effectively with soap and water."
      ]
    },
        {
      "tag": "cold_symptoms",
      "patterns": [
        "What are symptoms of a cold?",
        "Could you list some of the symptoms of a cold?",
        "Cold symptoms?",
        "What does a cold look like?",
        "What effect does a cold have on a person's body?"
      ],
      "responses": [
        "Some symptoms of a cold include a runny nose or nasal congestion, cough, sneezing, sore throat, headache, mild body aches, and a fever."
      ]
    },
        {
      "tag": "cold_duration",
      "patterns": [
        "How long does a cold last?",
        "When will a cold go away?",
        "For when should I expect cold symptoms to go away?",
        "After how many days will a cold go away?",
        "After how many weeks will a cold go away?"
      ],
      "responses": [
        "A cold should last less than a week."
      ]
    },
        {
      "tag": "c19_definition",
      "patterns": [
        "What is COVID-19?",
        "Could you define COVID-19?",
        "Explain COVID-19 to me.",
        "COVID-19?",
        "What is covid?",
        "Could you define covid?",
        "Explain covid to me.",
        "covid?",
        "What is the Coronavirus",
        "Could you define the Coronavirus?",
        "Explain the Coronavirus to me.",
        "Coronavirus?"
      ],
      "responses": [
        "COVID-19 is a very contagious respiratory disease, with symptoms that feel similar to those of a cold, the flu, or even pneumonia."
      ]
    },
        {
      "tag": "c19_prevention",
      "patterns": [
        "What can I do to prevent COVID-19?",
        "What can I do to lower the changes of me getting COVID-19?",
        "Is COVID-19 preventable?",
        "Could you help me mitigate the risk of getting COVID-19?",
        "How do I stop COVID-19?",
        "What can I do to prevent covid?",
        "What can I do to lower the changes of me getting covid?",
        "Is covid preventable?",
        "Could you help me mitigate the risk of getting covid?",
        "How do I stop covid?",
        "What can I do to prevent the Coronavirus?",
        "What can I do to lower the changes of me getting the Coronavirus?",
        "Is the Coronavirus preventable?",
        "Could you help me mitigate the risk of getting the Coronavirus?",
        "How do I stop the Coronavirus?",
        "How do I treat COVID-19?",
        "How do I treat covid?",
        "How do I treat the Coronavirus?"
      ],
      "responses": [
        "The Centers for Disease Control and Prevention (CDC) have many recommendations, which include receiving COVID-19 vaccines, having good hygiene, and staying home when sick."
      ]
    },
        {
      "tag": "c19_symptoms",
      "patterns": [
        "What are symptoms of COVID-19?",
        "Could you list some of the symptoms of COVID-19?",
        "COVID-19 symptoms?",
        "What does COVID-19 look like?",
        "What effect does COVID-19 have on a person's body?"
      ],
      "responses": [
        "Some symptoms of COVID-19 include fever, chills, cough, shortness of breath, muscle aches, headache, fatigue, loss of taste or smell, nasal congestion or rhinorrhea, sore throat, and vomiting or diarrhea, and skin rashes."
      ]
    },
        {
      "tag": "c19_duration",
      "patterns": [
        "How long does COVID-19 last?",
        "When will COVID-19 go away?",
        "For when should I expect COVID-19 symptoms to go away?",
        "After how many days will COVID-19 go away?",
        "After how many weeks will COVID-19 go away?",
        "How long does covid last?",
        "When will covid go away?",
        "For when should I expect covid symptoms to go away?",
        "After how many days will covid go away?",
        "After how many weeks will covid go away?",
        "How long does the Coronavirus last?",
        "When will the Coronavirus go away?",
        "For when should I expect Coronavirus symptoms to go away?",
        "After how many days will the Coronavirus go away?",
        "After how many weeks will the Coronavirus go away?"
      ],
      "responses": [
        "For a mild case, COVID-19 might last between a week or two. However, serious cases can take more than six weeks. Please see a doctor if your COVID-19 symptoms have not gone away after a few weeks."
      ]
    },
    {
      "tag": "cold_flu_covid_discussion",
      "patterns": [
        "What is the difference between a cold, the flu, and COVID-19?",
        "What is the difference between a cold, the flu, and covid?",
        "What is the difference between a cold, the flu, and Coronavirus?",
        "How do I tell apart a cold, the flu, and covid?",
        "What are the differences and similarities between a cold, the flu, and covid?"
      ],
      "responses": [
        "A cold is generally more mild than the flu. For example, the flu’s symptoms tend to be more severe than those of a cold. However, when it comes to COVID-19, it is hard to determine whether someone has the flu, a cold, or COVID-19 without proper testing because each disease shares a lot of the same symptoms. In order to fix this issue, please take a COVID-19 test or see your local doctor."
      ]
    },
            {
      "tag": "gastroenteritis_definition",
      "patterns": [
        "What is gastroenteritis?",
        "Could you define gastroenteritis?",
        "Explain gastroenteritis to me.",
        "Gastroenteritis?"
      ],
      "responses": [
        "Gastroenteritis, or the stomach flu, is the inflammation of the gastrointestinal tract."
      ]
    },
        {
      "tag": "gastroenteritis_prevention",
      "patterns": [
        "What can I do to prevent gastroenteritis?",
        "What can I do to lower the changes of me getting gastroenteritis?",
        "Is gastroenteritis preventable?",
        "Could you help me mitigate the risk of getting gastroenteritis?",
        "How do I stop gastroenteritis?",
        "How do I treat gastroenteritis?"
      ],
      "responses": [
        "Make sure you are vaccinated, wash your hands, prepare food safely, and avoid sharing personal items that may be contaminated."
      ]
    },
        {
      "tag": "gastroenteritis_symptoms",
      "patterns": [
        "What are symptoms of gastroenteritis?",
        "Could you list some of the symptoms of gastroenteritis?",
        "Gastroenteritis symptoms?",
        "What does gastroenteritis look like?",
        "What effect does gastroenteritis have on a person's body?"
      ],
      "responses": [
        "Gastroenteritis, or the stomach flu, can result in abdominal pain, nausea, vomiting, diarrhea, dehydration, loss of appetite, bloating, fever, fatigue, muscle aches, sweating, chills, weight loss, and blood or mucus in the stool. Keep in mind these are not the only symptoms that could appear."
      ]
    },
        {
      "tag": "gastroenteritis_duration",
      "patterns": [
        "How long does gastroenteritis last?",
        "When will gastroenteritis go away?",
        "For when should I expect gastroenteritis symptoms to go away?",
        "After how many days will gastroenteritis go away?",
        "After how many weeks will gastroenteritis go away?"
      ],
      "responses": [
        "Gastroenteritis may last up to fourteen days."
      ]
    },
        {
      "tag": "sinus_definition",
      "patterns": [
        "What is a sinus infection?",
        "Could you define a sinus infection?",
        "Explain a sinus infection to me.",
        "Sinus infection?"
      ],
      "responses": [
        "A sinus infection is the inflammation of the issues in your sinuses, which include the spaces in your forehead, cheeks, and nose usually filled with air."
      ]
    },
        {
      "tag": "sinus_prevention",
      "patterns": [
        "What can I do to prevent a sinus infection?",
        "What can I do to lower the changes of me getting a sinus infection?",
        "Is a sinus infection preventable?",
        "Could you help me mitigate the risk of getting a sinus infection?",
        "How do I stop a sinus infection?",
        "How do I treat a sinus infection?"
      ],
      "responses": [
        "This infection can be treated by drinking fluids, using nasal saline rinses, and taking cold and allergy medications."
      ]
    },
        {
      "tag": "sinus_symptoms",
      "patterns": [
        "What are symptoms of a sinus infection?",
        "Could you list some of the symptoms of a sinus infection?",
        "Sinus infection symptoms?",
        "What does a sinus infection look like?",
        "What effect does a sinus infection have on a person's body?"
      ],
      "responses": [
        "Symptoms of a sinus infection include postnasal drip (mucus in your throat), runny nose with thick yellow or green mucus, stuffy nose, facial pressure (especially around your nose, eyes, and forehead, which may get worse when you move your head or bend over), pain in your teeth or ears, fever, cough, headache, and tiredness."
      ]
    },
        {
      "tag": "sinus_duration",
      "patterns": [
        "How long does a sinus infection last?",
        "When will a sinus infection go away?",
        "For when should I expect sinus infection symptoms to go away?",
        "After how many days will a sinus infection go away?",
        "After how many weeks will a sinus infection go away?"
      ],
      "responses": [
        "A sinus infection usually lasts from a week to ten days."
      ]
    },
        {
      "tag": "pneumonia_definition",
      "patterns": [
        "What is pneumonia?",
        "Could you define pneumonia?",
        "Explain pneumonia to me.",
        "Pneumonia?"
      ],
      "responses": [
        "Pneumonia is an infection of one or both of the lungs in which pus and other kinds of liquids fill up the air sacs."
      ]
    },
        {
      "tag": "pneumonia_prevention",
      "patterns": [
        "What can I do to prevent pneumonia?",
        "What can I do to lower the changes of me getting pneumonia?",
        "Is a pneumonia preventable?",
        "Could you help me mitigate the risk of getting pneumonia?",
        "How do I stop pneumonia?"
      ],
      "responses": [
        "Antibiotics will usually help speed the recovery process for bacterial pneumonia, but viral pneumonia tends to get better on its own. A yearly flu shot can also help since the flu is a common cause of pneumonia."
      ]
    },
        {
      "tag": "pneumonia_symptoms",
      "patterns": [
        "What are symptoms of pneumonia?",
        "Could you list some of the symptoms of pneumonia?",
        "Pneumonia symptoms?",
        "What does pneumonia look like?",
        "What effect does the pneumonia have on a person's body?"
      ],
      "responses": [
        "Based on bacterial pneumonia, symptoms of it include a bluish color to lips and fingernails, confused mental state, cough that produces green, yellow, or bloody mucus, fever, loss of appetite, heavy sweating, low energy or extreme tiredness, rapid breathing, rapid pulse, shaking chills, sharp or stabbing chest pain that is worse with deep breathing or coughing, and shortness of breath that gets worse with activity. However, viral pneumonia, which has the same early symptoms as bacterial pneumonia, can be followed by headaches, increasing shortness of breath, muscle pain, weakness, and worsening of the cough."
      ]
    },
        {
      "tag": "pneumonia_duration",
      "patterns": [
        "How long does pneumonia last?",
        "When will pneumonia go away?",
        "For when should I expect pneumonia symptoms to go away?",
        "After how many days will pneumonia go away?",
        "After how many weeks will pneumonia go away?"
      ],
      "responses": [
        "Bacterial and viral pneumonia can last several weeks."
      ]
    },
            {
      "tag": "headache_definition",
      "patterns": [
        "What is a headache?",
        "Could you define a headache?",
        "Explain a headache to me.",
        "Headache?"
      ],
      "responses": [
        "A headache is a condition where an individual will experience pain in the head or face that can feel constant, sharp, dull, or even like placing pressure on one’s head."
      ]
    },
        {
      "tag": "headache_prevention",
      "patterns": [
        "What can I do to prevent a headache?",
        "What can I do to lower the changes of me getting a headache?",
        "Is a headache preventable?",
        "Could you help me mitigate the risk of getting a headache?",
        "How do I stop a headache?"
      ],
      "responses": [
        "To prevent headaches, people can avoid triggers such as lack of sleep, change eating habits, exercise, rest in a quiet, dark location, medicine, and stress management. Please see a doctor immediately if the pain is persistent and extremely uncomfortable."
      ]
    },
        {
      "tag": "headache_symptoms",
      "patterns": [
        "What are symptoms of a headache?",
        "Could you list some of the symptoms of a headache?",
        "Headache symptoms?",
        "What does a headache look like?",
        "What effect does a headache have on a person's body?"
      ],
      "responses": [
        "The severity of the headache symptoms very drastically, but some general symptoms include a slow onset of the headache, head pain on both sides, dull pain, band-like formation of pain around the head, pain around the back of the head or neck, and mild to moderate pain levels."
      ]
    },
        {
      "tag": "headache_duration",
      "patterns": [
        "How long does a headache last?",
        "When will a headache go away?",
        "For when should I expect headache symptoms to go away?",
        "After how many days will a headache go away?",
        "After how many weeks will a headache go away?"
      ],
      "responses": [
        "Headaches can vary greatly when it comes to how long pain will last, where it is located, and how severe the pain actually is. However, they typically last twenty minutes to several hours. Some headaches can last several days."
      ]
    },
            {
      "tag": "bruise_definition",
      "patterns": [
        "What is a bruise?",
        "Could you define a bruise?",
        "Explain a bruise to me.",
        "Bruise?"
      ],
      "responses": [
        "A bruise, or contusion, occurs when skin becomes discolored due to damaged, leaking blood vessels under the skin."
      ]
    },
        {
      "tag": "bruise_prevention",
      "patterns": [
        "What can I do to prevent a bruise?",
        "What can I do to lower the changes of me getting a bruise?",
        "Is a bruise preventable?",
        "Could you help me mitigate the risk of getting a bruise?",
        "How do I stop a bruise?"
      ],
      "responses": [
        "A lot of people will experience some kind of bruising, but you can minimize it by removing tripping hazards in your home, avoiding bumping into hard surfaces, receiving sufficient vitamins in your diet, and wearing protective gear such as pads when playing contact sports, biking, or riding a motorcycle."
      ]
    },
        {
      "tag": "bruise_symptoms",
      "patterns": [
        "What are symptoms of a bruise?",
        "Could you list some of the symptoms of a bruise?",
        "Bruise symptoms?",
        "What does the a bruise look like?",
        "What effect does a bruise have on a person's body?"
      ],
      "responses": [
        "Although bruises vary in size, shape, and hue, symptoms generally include pain or a sore feeling when you touch the bruise, skin discoloration (red to purple, black, brown, or yellow), and swelling or a raised bump on the skin."
      ]
    },
        {
      "tag": "bruise_duration",
      "patterns": [
        "How long does a bruise last?",
        "When will a bruise go away?",
        "For when should I expect bruise symptoms to go away?",
        "After how many days will a bruise go away?",
        "After how many weeks will a bruise go away?"
      ],
      "responses": [
        "The duration of a bruise will last for some time. However, most bruises will disappear within two weeks without any kind of treatment. Severe bruises can last a month or more."
      ]
    },
    {
      "tag": "concussion_definition",
      "patterns": [
        "What is a concussion?",
        "Could you define a concussion?",
        "Explain a concussion to me.",
        "Concussion?"
      ],
      "responses": [
        "A concussion is a brain injury that transpires when force is transmitted to the brain, which results in the brain moving fast within the skull. People commonly receive concussions with a direct blow to the head that causes the brain to rock violently within the skull."
      ]
    },
        {
      "tag": "concussion_prevention",
      "patterns": [
        "What can I do to prevent a concussion?",
        "What can I do to lower the changes of me getting a concussion?",
        "Is a concussion preventable?",
        "Could you help me mitigate the risk of getting a concussion?",
        "How do I stop a concussion?"
      ],
      "responses": [
        "Some ways to prevent a concussion include wearing the necessary headgear when engaging in a contact sport or some other physical activity, wearing seatbelts in cars, installing safety gates to prevent children from falling down stairs, and even strengthening your neck muscles."
      ]
    },
        {
      "tag": "concussion_symptoms",
      "patterns": [
        "What are symptoms of a concussion?",
        "Could you list some of the symptoms of a concussion?",
        "Concussion symptoms?",
        "What does a concussion look like?",
        "What effect does a concussion have on a person's body?"
      ],
      "responses": [
        "With concussions, there are physical, cognitive, emotional, and sleep symptoms. \n-Physical symptoms include headaches, nausea, vomiting, balance problems, dizziness, visual problems, fatigue, sensitivity to light and noise, and numbness or tingling. \n-Cognitive symptoms include feeling mentally foggy or slowed down and difficulty concentrating or remembering. \n-Emotional symptoms include irritability or moodiness, sadness, decreased interest in hobbies, and nervousness. \n-Sleep symptoms include drowsiness, sleeping less than usual or more than usual, and trouble falling asleep. \n"
      ]
    },
        {
      "tag": "concussion_duration",
      "patterns": [
        "How long does a concussion last?",
        "When will a concussion go away?",
        "For when should I expect concussion symptoms to go away?",
        "After how many days will a concussion go away?",
        "After how many weeks will a concussion go away?"
      ],
      "responses": [
        "With proper treatment, most concussions will last only fourteen to twenty-one days."
      ]
    },
    {
      "tag": "strain_definition",
      "patterns": [
        "What is a strain?",
        "Could you define a strain?",
        "Explain a strain to me.",
        "Strain?"
      ],
      "responses": [
        "A strain involves the stretching or tearing of muscle fibers. They occur due to one of two reasons: The muscle has been stretched beyond what it can withstand or it has been forced to contract too strongly."
      ]
    },
        {
      "tag": "strain_prevention",
      "patterns": [
        "What can I do to prevent a strain?",
        "What can I do to lower the changes of me getting a strain?",
        "Is a strain preventable?",
        "Could you help me mitigate the risk of getting a strain?",
        "How do I stop a strain?"
      ],
      "responses": [
        "To prevent muscle strains, you can warm up before participating in sports and other activities, stretch and strengthen your muscles, gradually increase the intensity of your training, maintain a healthy body weight (obesity can stretch muscles), practice good posture, and work on correct form when lifting heavy objects."
      ]
    },
        {
      "tag": "strain_symptoms",
      "patterns": [
        "What are symptoms of a strain?",
        "Could you list some of the symptoms of a strain?",
        "Strain symptoms?",
        "What does a strain look like?",
        "What effect does a strain have on a person's body?"
      ],
      "responses": [
        "Symptoms of a strain include muscle pain or tenderness (especially after an activity that stretches or violently contracts the muscles), muscle swelling, discoloration, muscle cramp or spasm, a decrease in muscle strength or a complete loss of muscle function (the latter is indicative of a Grade III strain), a pop in the muscle at the time of the injury, and a gap, dent, or other defect in the normal outline of the muscle (which is indicative of a Grade III strain)."
      ]
    },
        {
      "tag": "strain_duration",
      "patterns": [
        "How long does a strain last?",
        "When will a strain go away?",
        "For when should I expect strain symptoms to go away?",
        "After how many days will a strain go away?",
        "After how many weeks will a strain go away?"
      ],
      "responses": [
        "Strains come in three grades. The higher the number, the longer it may take to heal your injury. In addition, the location of the strain matters. However, in a mild back strain, symptoms usually disappear within four to six weeks; in the legs, a mild or moderate strain may need eight or more weeks to heal. Grade III strains may need to heal even longer or have to be surgically repaired."
      ]
    },
            {
      "tag": "sprain_definition",
      "patterns": [
        "What is a sprain?",
        "Could you define a sprain?",
        "Explain a sprain to me.",
        "Sprain?"
      ],
      "responses": [
        "A sprain is an injury that stresses a joint and overstretches or, in some cases, even ruptures its supporting ligaments. Keep in mind that there are various kinds of sprains."
      ]
    },
        {
      "tag": "sprain_prevention",
      "patterns": [
        "What can I do to prevent a sprain?",
        "What can I do to lower the changes of me getting a sprain?",
        "Is a sprain preventable?",
        "Could you help me mitigate the risk of getting a sprain?",
        "How do I stop a sprain?"
      ],
      "responses": [
        "Although sprains are hard to prevent, you can reduce the odds of receiving a sprain. Wear protective equipment, do not fight through pain if something hurts after a physical activity, give your body time to rest and recover after an intense activity, stretch and warm up before exercising, cool down and stretch after a physical activity."
      ]
    },
        {
      "tag": "sprain_symptoms",
      "patterns": [
        "What are symptoms of a sprain?",
        "Could you list some of the symptoms of a sprain?",
        "Sprain symptoms?",
        "What does a sprain look like?",
        "What effect does a sprain have on a person's body?"
      ],
      "responses": [
        "Sprain symptoms include pain, swelling, bruising or discoloration, instability (you cannot put weight on the joint or move comfortably), and reduced range of motion (it is hard or painful to move the joint as far as usual)."
      ]
    },
        {
      "tag": "sprain_duration",
      "patterns": [
        "How long does a sprain last?",
        "When will a sprain go away?",
        "For when should I expect sprain symptoms to go away?",
        "After how many days will a sprain go away?",
        "After how many weeks will a sprain go away?"
      ],
      "responses": [
        "The location and severity of your sprain will determine how long it will take to heal. Similar to strains, sprains have a grading system from I to III, with III being the worst kind of sprain condition."
      ]
    },
            {
      "tag": "fracture_definition",
      "patterns": [
        "What is a fracture?",
        "Could you define a fracture?",
        "Explain a fracture to me.",
        "Fracture?"
      ],
      "responses": [
        "A fracture, or a broken bone, is a condition where a bone in your body breaks due to it being unable to withstand a force being put on it. Keep in mind that there are many different types of fractures."
      ]
    },
        {
      "tag": "fracture_prevention",
      "patterns": [
        "What can I do to prevent a fracture?",
        "What can I do to lower the changes of me getting a fracture?",
        "Is a fracture preventable?",
        "Could you help me mitigate the risk of getting a fracture?",
        "How do I stop a fracture?"
      ],
      "responses": [
        "To lower the chances of receiving a fracture, make sure to have a healthy diet that includes vitamin D and calcium to strengthen your bones, do weight-bearing activities, and do not use any form of tobacco as they interfere with the healing process."
      ]
    },
        {
      "tag": "fracture_symptoms",
      "patterns": [
        "What are symptoms of a fracture?",
        "Could you list some of the symptoms of a fracture?",
        "Fracture symptoms?",
        "What does a fracture look like?",
        "What effect does a fracture have on a person's body?"
      ],
      "responses": [
        "Symptoms of a fracture or broken bone include sudden pain, trouble using or moving the injured area or nearby joints, swelling, obvious deformity, and warmth, bruising, or redness."
      ]
    },
        {
      "tag": "fracture_duration",
      "patterns": [
        "How long does a fracture last?",
        "When will a fracture go away?",
        "For when should I expect fracture symptoms to go away?",
        "After how many days will a fracture go away?",
        "After how many weeks will a fracture go away?"
      ],
      "responses": [
        "A fracture’s healing time depends on the location and severity of the fracture. Most fractures tend to heal within six to eight weeks, but some fractures may need twenty weeks or more to heal."
      ]
    },
    {
      "tag": "information_origin",
      "patterns": [
        "Where are you getting this information from?",
        "What sources did you use to determine this condition?",
        "What sources did you use for this information?",
        "Are the sources that you use from credible origins?"
      ],
      "responses": [
        "All of the information that I am providing you regarding ailments and physical injuries is provided by the Centers For Disease Control and Prevention and other credible sources such as publications by Yale Medicine."
      ]
    }
  ]
}